; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph4 - mode
	image1 - mode
	image3 - mode
	infrared0 - mode
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet8 image1)
	(have_image Star9 infrared0)
	(have_image Planet10 image3)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon13 infrared0)
))

)

; plan
1. (turn_to satellite1 star1 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 6
5. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 1 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 6
9. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
10. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 6
11. (turn_to satellite1 phenomenon12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 6
12. (take_image satellite1 phenomenon12 instrument1 image3)
   added: (have_image phenomenon12 image3)
   goals met: 3 of 6
13. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 6
14. (take_image satellite1 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 4 of 6
15. (turn_to satellite1 planet10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet10)
   goals met: 4 of 6
16. (take_image satellite1 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   goals met: 5 of 6
17. (turn_to satellite1 star9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star9)
   goals met: 5 of 6
18. (take_image satellite1 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 6 of 6
